#ifndef __BOARD_H__
#define __BOARD_H__

/*
*************************************************************************
*                             包含的头文件
*************************************************************************
*/
/* STM32 固件库头文件 */
#include "stm32f4xx.h"

/* 开发板外设驱动头文件 */
#include "bsp_led.h"
#include "bsp_usart.h"

/* 只针对ARM 编译器，在其它编译器，该宏的实现会不一样 */
#define ALIGN(n) __attribute__((aligned(n)))

/*
*************************************************************************
*                               函数声明
*************************************************************************
*/
void rt_hw_board_init(void);
void SysTick_Handler(void);

#endif /* __BOARD_H__ */

